{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.1.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}, "outputs": {"Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "64"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "16"}, {"size": "512"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "256"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Low_res_part/tf.split_13/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_12/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_11/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_10/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_9/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_8/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.reshape_7/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_7/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_8/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_9/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_2/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_10/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_3/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_11/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_4/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.reshape_7/Reshape", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/Low_res_part/tf.reshape_7/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Low_res_part/tf.reshape_7/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Low_res_part/conv2d_transpose/Shape", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/1", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/2", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/Low_res_part/tf.reshape_7/Reshape"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Low_res_part/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/Low_res_part/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/conv2d_transpose/BiasAdd", "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_8/split", "op": "Split", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_8/split/split_dim", "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_11/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_8/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.multiply_11/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_8/split", "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_11/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_11/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d/Shape", "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack", "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack_1", "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice", "StatefulPartitionedCall/Low_res_part/up_sampling2d/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_11/Mul", "StatefulPartitionedCall/Low_res_part/up_sampling2d/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_7/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_7/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_7/Pad", "StatefulPartitionedCall/Low_res_part/depthwise_conv2d/depthwise/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization_1/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Low_res_part/depthwise_conv2d/depthwise", "StatefulPartitionedCall/Low_res_part/conv2d/Conv2D_weights", "StatefulPartitionedCall/Low_res_part/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_9/split", "op": "Split", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_9/split/split_dim", "StatefulPartitionedCall/Low_res_part/batch_normalization_1/FusedBatchNormV3"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_12/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_9/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.multiply_12/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_9/split", "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_12/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_12/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_1/Shape", "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack", "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack_1", "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice", "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_12/Mul", "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_8/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_8/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_8/Pad", "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_1/depthwise/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization_2/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Low_res_part/depthwise_conv2d_1/depthwise", "StatefulPartitionedCall/Low_res_part/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/Low_res_part/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_10/split", "op": "Split", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_10/split/split_dim", "StatefulPartitionedCall/Low_res_part/batch_normalization_2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_13/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_10/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.multiply_13/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_10/split", "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_13/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_13/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_13/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_2/Shape", "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack", "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack_1", "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice", "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_13/Mul", "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_9/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_9/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_2/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_9/Pad", "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_2/depthwise/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization_3/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Low_res_part/depthwise_conv2d_2/depthwise", "StatefulPartitionedCall/Low_res_part/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/Low_res_part/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_11/split", "op": "Split", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_11/split/split_dim", "StatefulPartitionedCall/Low_res_part/batch_normalization_3/FusedBatchNormV3"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_14/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_11/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.multiply_14/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_11/split", "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_14/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_14/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_14/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_3/Shape", "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack", "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack_1", "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice", "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_14/Mul", "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/mul"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_10/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_3/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_10/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_3/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_10/Pad", "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_3/depthwise/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization_4/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Low_res_part/depthwise_conv2d_3/depthwise", "StatefulPartitionedCall/Low_res_part/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/Low_res_part/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_12/split", "op": "Split", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_12/split/split_dim", "StatefulPartitionedCall/Low_res_part/batch_normalization_4/FusedBatchNormV3"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_15/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_12/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.multiply_15/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_12/split", "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_15/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_15/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_15/Mul"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_4/Shape", "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack", "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack_1", "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice", "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_15/Mul", "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_11/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/Low_res_part/up_sampling2d_4/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_11/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_4/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_11/Pad", "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_4/depthwise/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization_5/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Low_res_part/depthwise_conv2d_4/depthwise", "StatefulPartitionedCall/Low_res_part/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/Low_res_part/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_13/split", "op": "Split", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_13/split/split_dim", "StatefulPartitionedCall/Low_res_part/batch_normalization_5/FusedBatchNormV3"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_16/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_13/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Low_res_part/tf.math.multiply_16/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Low_res_part/tf.split_13/split", "StatefulPartitionedCall/Low_res_part/tf.math.sigmoid_16/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_3", "op": "Identity", "input": ["StatefulPartitionedCall/Low_res_part/tf.math.multiply_16/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of12.bin", "group1-shard2of12.bin", "group1-shard3of12.bin", "group1-shard4of12.bin", "group1-shard5of12.bin", "group1-shard6of12.bin", "group1-shard7of12.bin", "group1-shard8of12.bin", "group1-shard9of12.bin", "group1-shard10of12.bin", "group1-shard11of12.bin", "group1-shard12of12.bin"], "weights": [{"name": "StatefulPartitionedCall/Low_res_part/tf.split_13/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_12/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_11/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_10/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_9/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.split_8/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 512, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.reshape_7/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_transpose/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_7/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d/depthwise/ReadVariableOp", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_8/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_1/depthwise/ReadVariableOp", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_2/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_9/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_2/depthwise/ReadVariableOp", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_3/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_10/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_3/depthwise/ReadVariableOp", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/up_sampling2d_4/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/tf.compat.v1.pad_11/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Low_res_part/depthwise_conv2d_4/depthwise/ReadVariableOp", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d/Conv2D_weights", "shape": [3, 3, 256, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d/Conv2D_bn_offset", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_1/Conv2D_weights", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Scaled", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_1/Conv2D_bn_offset", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_2/Conv2D_weights", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_2/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_3/Conv2D_weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_3/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_4/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/batch_normalization/FusedBatchNormV3/Offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Low_res_part/conv2d_4/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}]}]}