{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.1.0", "signature": {"inputs": {"input_4:0": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "256"}]}}, "input_5:0": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "128"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "64"}]}}, "input_3:0": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "16"}, {"size": "512"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "512"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/High_res_part/tf.split_15/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.split_14/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_8/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_3/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_9/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_12/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/depthwise_conv2d_5/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_10/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_4/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_11/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_13/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/depthwise_conv2d_6/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_12/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_5/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_13/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_16/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "64"}]}}}}, {"name": "input_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "16"}, {"size": "512"}]}}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_12/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_12/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "256"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_5", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "128"}]}}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_5/BiasAdd", "op": "_FusedConv2D", "input": ["input_3", "StatefulPartitionedCall/High_res_part/conv2d_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_9/Reshape", "op": "Reshape", "input": ["input_3", "StatefulPartitionedCall/High_res_part/tf.reshape_9/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_13/BiasAdd", "op": "_FusedConv2D", "input": ["input_3", "StatefulPartitionedCall/High_res_part/conv2d_13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_13/Reshape", "op": "Reshape", "input": ["input_3", "StatefulPartitionedCall/High_res_part/tf.reshape_13/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_9/BiasAdd", "op": "_FusedConv2D", "input": ["input_4", "StatefulPartitionedCall/High_res_part/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_11/Reshape", "op": "Reshape", "input": ["input_4", "StatefulPartitionedCall/High_res_part/tf.reshape_11/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_8/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/High_res_part/conv2d_5/BiasAdd", "StatefulPartitionedCall/High_res_part/tf.reshape_8/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_12/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/High_res_part/conv2d_13/BiasAdd", "StatefulPartitionedCall/High_res_part/tf.reshape_12/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_10/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/High_res_part/conv2d_9/BiasAdd", "StatefulPartitionedCall/High_res_part/tf.reshape_10/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_3/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/High_res_part/tf.reshape_8/Reshape", "StatefulPartitionedCall/High_res_part/tf.nn.softmax_3/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_5/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/High_res_part/tf.reshape_12/Reshape", "StatefulPartitionedCall/High_res_part/tf.nn.softmax_5/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_4/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/High_res_part/tf.reshape_10/Reshape", "StatefulPartitionedCall/High_res_part/tf.nn.softmax_4/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.softmax_3/transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_5/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.softmax_5/transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_4/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.softmax_4/transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.linalg.matmul_3/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.softmax_3/Softmax", "StatefulPartitionedCall/High_res_part/tf.reshape_9/Reshape"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.linalg.matmul_5/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.softmax_5/Softmax", "StatefulPartitionedCall/High_res_part/tf.reshape_13/Reshape"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.linalg.matmul_4/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.softmax_4/Softmax", "StatefulPartitionedCall/High_res_part/tf.reshape_11/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_3/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/High_res_part/tf.linalg.matmul_3/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "StatefulPartitionedCall/High_res_part/tf.expand_dims_3/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_5/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/High_res_part/tf.linalg.matmul_5/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "StatefulPartitionedCall/High_res_part/tf.expand_dims_5/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_4/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/High_res_part/tf.linalg.matmul_4/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "StatefulPartitionedCall/High_res_part/tf.expand_dims_4/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.leaky_relu_3/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/tf.expand_dims_3/ExpandDims", "StatefulPartitionedCall/High_res_part/conv2d_6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.1}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.leaky_relu_5/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/tf.expand_dims_5/ExpandDims", "StatefulPartitionedCall/High_res_part/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.1}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.leaky_relu_4/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/tf.expand_dims_4/ExpandDims", "StatefulPartitionedCall/High_res_part/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.1}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_7/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.leaky_relu_3/LeakyRelu", "StatefulPartitionedCall/High_res_part/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_15/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.leaky_relu_5/LeakyRelu", "StatefulPartitionedCall/High_res_part/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_11/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/tf.nn.leaky_relu_4/LeakyRelu", "StatefulPartitionedCall/High_res_part/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_17/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/High_res_part/conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_21/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/High_res_part/conv2d_15/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_19/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/High_res_part/conv2d_11/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.multiply_17/Mul", "op": "Mul", "input": ["input_2", "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_17/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/High_res_part/tf.math.multiply_17/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/High_res_part/up_sampling2d_5/Shape", "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack", "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack_1", "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/mul", "op": "Mul", "input": ["StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice", "StatefulPartitionedCall/High_res_part/up_sampling2d_5/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/High_res_part/tf.math.multiply_17/Mul", "StatefulPartitionedCall/High_res_part/up_sampling2d_5/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_12/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/High_res_part/up_sampling2d_5/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_12/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/depthwise_conv2d_5/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_12/Pad", "StatefulPartitionedCall/High_res_part/depthwise_conv2d_5/depthwise/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/High_res_part/batch_normalization_6/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/depthwise_conv2d_5/depthwise", "StatefulPartitionedCall/High_res_part/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/High_res_part/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.split_14/split", "op": "Split", "input": ["StatefulPartitionedCall/High_res_part/tf.split_14/split/split_dim", "StatefulPartitionedCall/High_res_part/batch_normalization_6/FusedBatchNormV3"], "attr": {"num_split": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_18/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/High_res_part/tf.split_14/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.multiply_18/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/High_res_part/tf.split_14/split", "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_18/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.multiply_19/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/High_res_part/tf.math.multiply_18/Mul", "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_19/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/High_res_part/tf.math.multiply_19/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/High_res_part/up_sampling2d_6/Shape", "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack", "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack_1", "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/mul", "op": "Mul", "input": ["StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice", "StatefulPartitionedCall/High_res_part/up_sampling2d_6/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/High_res_part/tf.math.multiply_19/Mul", "StatefulPartitionedCall/High_res_part/up_sampling2d_6/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_13/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/High_res_part/up_sampling2d_6/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_13/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/High_res_part/depthwise_conv2d_6/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_13/Pad", "StatefulPartitionedCall/High_res_part/depthwise_conv2d_6/depthwise/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/High_res_part/batch_normalization_7/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/depthwise_conv2d_6/depthwise", "StatefulPartitionedCall/High_res_part/conv2d_12/Conv2D_weights", "StatefulPartitionedCall/High_res_part/conv2d_12/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.split_15/split", "op": "Split", "input": ["StatefulPartitionedCall/High_res_part/tf.split_15/split/split_dim", "StatefulPartitionedCall/High_res_part/batch_normalization_7/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_20/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/High_res_part/tf.split_15/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.multiply_20/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/High_res_part/tf.split_15/split", "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_20/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/tf.math.multiply_21/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/High_res_part/tf.math.multiply_20/Mul", "StatefulPartitionedCall/High_res_part/tf.math.sigmoid_21/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_16/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/High_res_part/tf.math.multiply_21/Mul", "StatefulPartitionedCall/High_res_part/conv2d_16/Conv2D/ReadVariableOp", "StatefulPartitionedCall/High_res_part/conv2d_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/High_res_part/conv2d_16/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/High_res_part/tf.split_15/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.split_14/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_5/Conv2D/ReadVariableOp", "shape": [1, 1, 512, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_5/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_8/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_3/concat", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_9/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_3/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_6/Conv2D/ReadVariableOp", "shape": [1, 1, 512, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_6/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_7/Conv2D/ReadVariableOp", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_7/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_5/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_12/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/depthwise_conv2d_5/depthwise/ReadVariableOp", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_9/Conv2D/ReadVariableOp", "shape": [1, 1, 256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_9/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_10/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_4/concat", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_11/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_4/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_10/Conv2D/ReadVariableOp", "shape": [1, 1, 256, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_10/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_11/Conv2D/ReadVariableOp", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_11/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/up_sampling2d_6/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.compat.v1.pad_13/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/depthwise_conv2d_6/depthwise/ReadVariableOp", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_13/Conv2D/ReadVariableOp", "shape": [1, 1, 512, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_13/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_12/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.nn.softmax_5/concat", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.reshape_13/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/tf.expand_dims_5/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_14/Conv2D/ReadVariableOp", "shape": [1, 1, 512, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_14/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_15/Conv2D/ReadVariableOp", "shape": [1, 1, 8, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_15/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_16/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_16/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_12/Conv2D_weights", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_12/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_8/Conv2D_weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/High_res_part/conv2d_8/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}]}]}